/**
 ******************************************************************************
 * @file           : task_ctrl.h
 * @author         : WHY
 * @date           : 2026-4-3
 * @brief          : task_ctrl.cpp 的头文件
 *
 ******************************************************************************
 * @attention
 *
 ******************************************************************************
 */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef TASK_CTRL_H
#define TASK_CTRL_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes ------------------------------------------------------------------*/

/* Exported types ------------------------------------------------------------*/

/* Exported constants --------------------------------------------------------*/

/* Exported macro ------------------------------------------------------------*/

/* Exported defines ----------------------------------------------------------*/

/* Exported variables --------------------------------------------------------*/

/* Exported functions prototypes ---------------------------------------------*/
void TASK_CTRL(void const* argument);
void TASK_CTRLInit();
#ifdef __cplusplus
}
#endif

#endif  /* TASK_CTRL_H */
