/**
******************************************************************************
 * @file           : XXX.h
 * @author         : WHY
 * @date           : 2025-10-12
 * @brief          : XXX.c 的头文件
 *                   包含XXX的宏定义
 *                   XXX的变量类型声明
 *                   XXX的函数声明
 ******************************************************************************
 * @attention
 *
 ******************************************************************************
 */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef TASK_START_H
#define TASK_START_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes ------------------------------------------------------------------*/

/* Exported types ------------------------------------------------------------*/
typedef enum
{
    SAFETY = 0,//安全模式
    NORMAL,//正常模式
    IDENTIFY,//辨识模式
} ENU_Mode;

/* Exported constants --------------------------------------------------------*/

/* Exported macro ------------------------------------------------------------*/

/* Exported defines ----------------------------------------------------------*/

/* Exported variables --------------------------------------------------------*/

/* Exported functions prototypes ---------------------------------------------*/
void TASK_Start(void const* argument);

#ifdef __cplusplus
}
#endif

#endif  /* TASK_START_H */
