/**
******************************************************************************
 * @file           : XXX.h
 * @author         : WHY
 * @date           : 2025-10-12
 * @brief          : XXX.c 的头文件
 *                   包含XXX的宏定义
 *                   XXX的变量类型声明
 *                   XXX的函数声明
 ******************************************************************************
 * @attention
 *
 ******************************************************************************
 */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef ALG_OLS_H
#define ALG_OLS_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "arm_math.h"
/* Exported types ------------------------------------------------------------*/

/* Exported constants --------------------------------------------------------*/

/* Exported macro ------------------------------------------------------------*/

/* Exported defines ----------------------------------------------------------*/

/* Exported variables --------------------------------------------------------*/

/* Exported functions prototypes ---------------------------------------------*/
 int8_t DATA_OLS(int8_t n, int8_t m, const float32_t* X, const float32_t* Y, float32_t* theta);

#ifdef __cplusplus
}
#endif

#endif //ALG_OLS_H
