/**
******************************************************************************
 * @file           : alg_6Rarm.h
 * @author         : WHY
 * @date           : 2026-3-23
 * @brief          : alg_6Rarm.c 的头文件
 *                   包含机械臂连杆参数结构体、齐次变换矩阵结构体
 *
 *                   alg_6Rarm的函数声明
 ******************************************************************************
 * @attention
 *
 ******************************************************************************
 */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef ALG_6Rarm_H
#define ALG_6Rarm_H

/* Includes ------------------------------------------------------------------*/

/* Exported types ------------------------------------------------------------*/

/* Exported constants --------------------------------------------------------*/

/* Exported macro ------------------------------------------------------------*/

/* Exported defines ----------------------------------------------------------*/

/* Exported variables --------------------------------------------------------*/

/* Exported functions prototypes ---------------------------------------------*/
void DATA_JointAngleToTheta(const float *JointRad);
void DATA_TransformMatrices(void);
void DATA_ForwardDynamics(float *tau_out);
#endif //ALG_6Rarm_H
